# KUSTO Query Language (KQL)

===
[search] Operator:

search "err"
search in (SecurityEvent,SecurityAlert,A*) "err"
===
[where] Operator:
SecurityEvent
| where TimeGenerated > ago(1d)

SecurityEvent
| where TimeGenerated > ago(1h) and EventID == "4624"

SecurityEvent
| where TimeGenerated > ago(1h)
| where EventID == 4624
| where AccountType =~ "user"

SecurityEvent | where EventID in (4624, 4625)
===
[Let] Operator & Declare and resue variables:

let timeOffset = 7d;
let discardEventId = 4688;
SecurityEvent
| where TimeGenerated > ago(timeOffset*2) and TimeGenerated < ago(timeOffset)
| where EventID != discardEventId
===
# Declare dynamic tables or lists #

let suspiciousAccounts = datatable(account: string) [
    @"\administrator", 
    @"NT AUTHORITY\SYSTEM"
];
SecurityEvent | where Account in (suspiciousAccounts)

>>
let LowActivityAccounts =
    SecurityEvent 
    | summarize cnt = count() by Account 
    | where cnt < 1000;
LowActivityAccounts | where Account contains "SQL"
===
[extend] Operator.
The extend operator will create calculated columns and append the new columns to the result set.
The KQL example below uses the extend operator to create a new column, StartDir containing the directory a process was started in. 
The StartDir column is a calculated column containing the results of a substring function.

SecurityEvent
| where ProcessName != "" and Process != ""
| extend StartDir =  substring(ProcessName,0, string_size(ProcessName)-string_size(Process))
===
[order] Operator:

The order by operator can utilize any column or multiple columns by using a comma separator. 
Each column can be ascending or descending. The default order for a column is descending.

SecurityEvent
| where ProcessName != "" and Process != ""
| extend StartDir =  substring(ProcessName,0, string_size(ProcessName)-string_size(Process))
| order by StartDir desc, Process asc
===
[project] Operator:
project:	Select the columns to include, rename or drop, and insert new computed columns.

SecurityEvent
| project Computer, Account

SecurityEvent
| where ProcessName != "" and Process != ""
| extend StartDir =  substring(ProcessName,0, string_size(ProcessName)-string_size(Process))
| order by StartDir desc, Process asc
| project Process, StartDir
===
